In [1]:
import pandas as pd

# pandas data structures series dataframe

In [2]:
#Series
s1 = pd.Series([11,22,33,44,55,66,77,88,99,10])

In [3]:
s1 # pandas Series object
## pandas ny indexing khud provide kardee

0    11
1    22
2    33
3    44
4    55
5    66
6    77
7    88
8    99
9    10
dtype: int64

In [ ]:
#(index 0-9 default index given by series object)

In [4]:
s1[9]

10

In [5]:
s1[2,4,7,9,0]

KeyError: (2, 4, 7, 9, 0)

In [6]:
s1[[2,4,7,9,0]] # s1 can take single ting so we give it single list

2    33
4    55
7    88
9    10
0    11
dtype: int64

In [7]:
s1[5] = 555 # modifying a value in a series

In [8]:
s1

0     11
1     22
2     33
3     44
4     55
5    555
6     77
7     88
8     99
9     10
dtype: int64

In [10]:
del s1[5] # deleting value in series
# deleting multiple values not working

In [11]:
s1

0    11
1    22
2    33
3    44
4    55
6    77
7    88
8    99
9    10
dtype: int64

In [13]:
s1[[2,3,4]] = [222,333,444]
print(s1)

0     11
1     22
2    222
3    333
4    444
6     77
7     88
8     99
9     10
dtype: int64

In [15]:
s1[99] = 999 # if index not present then it will be added otherwise replace
s1

0      11
1      22
2     222
3     333
4     444
6      77
7      88
8      99
9      10
99    999
dtype: int64

In [16]:
s1[[22,33]] = [222,3333]

ValueError: [22 33] not contained in the index

In [17]:
s2 = pd.Series([10,20,30,40],index = ['oranges','apples','bananas','kiwi'])
s2

oranges    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [18]:
s2.index

Index(['oranges', 'apples', 'bananas', 'kiwi'], dtype='object')

In [19]:
s2.values

array([10, 20, 30, 40], dtype=int64)

In [21]:
our_index =['oranges','apples','bananas','kiwi']
s2 = pd.Series([10,20,30,40],index = our_index)
s2

oranges    10
apples     20
bananas    30
kiwi       40
dtype: int64

In [22]:
s2>30

oranges    False
apples     False
bananas    False
kiwi        True
dtype: bool

In [23]:
s2[s2>30] # wo record ayga jis per value true hogee

kiwi    40
dtype: int64

In [24]:
s2[s2<30]

oranges    10
apples     20
dtype: int64

In [25]:
'peach' in s2 #checking if required key is in series

False

In [26]:
'oranges' in s2

True

In [ ]:
#creating a series by using dictionary

In [28]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
data = pd.Series(sdata)
print(data)

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [33]:
states = ['California', 'Ohio', 'Oregon', 'Texas']
data1 = pd.Series(sdata,index = states)
print(data1)

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [34]:
data1.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [35]:
data1['California'] = 55000

In [36]:
data1

California    55000.0
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [37]:
data1.isnull()

California    False
Ohio          False
Oregon        False
Texas         False
dtype: bool

# DATAFRAME

In [45]:
#dataframe
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]} # values counting must be same ie 6 values in all keys

In [47]:
df1 = pd.DataFrame(data)

In [48]:
print(df1)

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [49]:
data1 = {'friends':[1,2,3],'names':['Maryah','Rabaat','Summaiya']}

In [50]:
df2 = pd.DataFrame(data1)

In [51]:
print(df2)

   friends     names
0        1    Maryah
1        2    Rabaat
2        3  Summaiya

In [52]:
type(df2)

pandas.core.frame.DataFrame

In [53]:
df1.shape

(6, 3)

In [54]:
df1['pop']

0    1.5
1    1.7
2    3.6
3    2.4
4    2.9
5    3.2
Name: pop, dtype: float64

In [55]:
df1.pop

<bound method NDFrame.pop of     state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2>

In [56]:
df1[['pop','state']]

   pop   state
0  1.5    Ohio
1  1.7    Ohio
2  3.6    Ohio
3  2.4  Nevada
4  2.9  Nevada
5  3.2  Nevada

In [57]:
del df1['pop']

In [58]:
df1

    state  year
0    Ohio  2000
1    Ohio  2001
2    Ohio  2002
3  Nevada  2001
4  Nevada  2002
5  Nevada  2003

In [59]:
df1['debt'] = 100

In [60]:
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   100
2    Ohio  2002   100
3  Nevada  2001   100
4  Nevada  2002   100
5  Nevada  2003   100

In [61]:
df1['debt'] = [100,200,300,100,500,800]

In [62]:
df1

    state  year  debt
0    Ohio  2000   100
1    Ohio  2001   200
2    Ohio  2002   300
3  Nevada  2001   100
4  Nevada  2002   500
5  Nevada  2003   800

In [63]:
df1['debt']= range(6)

In [64]:
df1

    state  year  debt
0    Ohio  2000     0
1    Ohio  2001     1
2    Ohio  2002     2
3  Nevada  2001     3
4  Nevada  2002     4
5  Nevada  2003     5

In [65]:
df1['debt']=df1['state']

In [66]:
df1

    state  year    debt
0    Ohio  2000    Ohio
1    Ohio  2001    Ohio
2    Ohio  2002    Ohio
3  Nevada  2001  Nevada
4  Nevada  2002  Nevada
5  Nevada  2003  Nevada

In [84]:
dic = {"ai for everyone":[78,98,90,56,55,67],"python1" :[78,98,99,100,80,98],"python2":[23,56,78,98,5,6]}
df = pd.DataFrame(dic,index = ["Nasir","sana","midha","summaiya","maryah",'rabaat'])

In [85]:
df

          ai for everyone  python1  python2
Nasir                  78       78       23
sana                   98       98       56
midha                  90       99       78
summaiya               56      100       98
maryah                 55       80        5
rabaat                 67       98        6

In [86]:
empty = []
for i in range(6):
    empty.append(dic['ai for everyone'][i]+dic['python1'][i]+dic['python2'][i])
    
df['total'] = empty

In [87]:
# orr can use this simple
df['total']= df['ai for everyone'] + df['python1'] + df['python2']

In [88]:
df

          ai for everyone  python1  python2  total
Nasir                  78       78       23    179
sana                   98       98       56    252
midha                  90       99       78    267
summaiya               56      100       98    254
maryah                 55       80        5    140
rabaat                 67       98        6    171

In [97]:
df['pass'] = df['total'] >200

In [98]:
df

          ai for everyone  python1  python2  total   pass
Nasir                  78       78       23    179  False
sana                   98       98       56    252   True
midha                  90       99       78    267   True
summaiya               56      100       98    254   True
maryah                 55       80        5    140  False
rabaat                 67       98        6    171  False

In [ ]:
df

In [99]:
numbers = [1,2,3,4,5,6,7,8,9,10,11,12,13,14,15]
evenarr = []
oddarr = []
for num in numbers:
    if num % 2 == 0:
        evenarr.append(num)
    else:
        oddarr.append(num)

In [100]:
print(evenarr)
print(oddarr)

[2, 4, 6, 8, 10, 12, 14]
[1, 3, 5, 7, 9, 11, 13, 15]

In [ ]:
[num for num in numbers if num]

In [102]:
df['pass']=["Pass"  if marks >=200 else "Fail"  for marks in df['total']]
df

          ai for everyone  python1  python2  total  pass
Nasir                  78       78       23    179  Fail
sana                   98       98       56    252  Pass
midha                  90       99       78    267  Pass
summaiya               56      100       98    254  Pass
maryah                 55       80        5    140  Fail
rabaat                 67       98        6    171  Fail

In [108]:
total_marks = 300
df['percentage'] =df['total'] / total_marks * 100
print(df)

          ai for everyone  python1  python2  total  pass  percentage
Nasir                  78       78       23    179  Fail   59.666667
sana                   98       98       56    252  Pass   84.000000
midha                  90       99       78    267  Pass   89.000000
summaiya               56      100       98    254  Pass   84.666667
maryah                 55       80        5    140  Fail   46.666667
rabaat                 67       98        6    171  Fail   57.000000

In [109]:
df['pass'] = ['pass' if df['ai for everyone'] or df['python1'] or df['python2'] >=33 else 'fail']

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().

In [110]:
df['pass'] = ["Pass" if  a >= 33 and b >=33 and c>=33 else "Fails" for a,b,c in zip (df['ai for everyone'], df['python1'] , df['python2'])]

In [113]:
df['pass'] = ["Pass" if  a >= 33 and b >=33 and c>=33 else "Fails" for a,b,c in df['ai for everyone'], df['python1'] , df['python2']]

SyntaxError: invalid syntax (<ipython-input-113-977bbf24e692>, line 1)

In [111]:
df

          ai for everyone  python1  python2  total   pass  percentage
Nasir                  78       78       23    179  Fails   59.666667
sana                   98       98       56    252   Pass   84.000000
midha                  90       99       78    267   Pass   89.000000
summaiya               56      100       98    254   Pass   84.666667
maryah                 55       80        5    140  Fails   46.666667
rabaat                 67       98        6    171  Fails   57.000000

In [120]:
df.head() # head( gives first  5 values)

          ai for everyone  python1  python2  total   pass  percentage
Nasir                  78       78       23    179  Fails   59.666667
sana                   98       98       56    252   Pass   84.000000
midha                  90       99       78    267   Pass   89.000000
summaiya               56      100       98    254   Pass   84.666667
maryah                 55       80        5    140  Fails   46.666667

In [121]:
df.tail() # tail gives last 5

          ai for everyone  python1  python2  total   pass  percentage
sana                   98       98       56    252   Pass   84.000000
midha                  90       99       78    267   Pass   89.000000
summaiya               56      100       98    254   Pass   84.666667
maryah                 55       80        5    140  Fails   46.666667
rabaat                 67       98        6    171  Fails   57.000000

In [122]:
df.head(1) # give 1 value

       ai for everyone  python1  python2  total   pass  percentage
Nasir               78       78       23    179  Fails   59.666667

In [124]:
df.loc['summaiya']

ai for everyone         56
python1                100
python2                 98
total                  254
pass                  Pass
percentage         84.6667
Name: summaiya, dtype: object

In [125]:
df.loc['sana':'summaiya'] # slicing also include last one thing

          ai for everyone  python1  python2  total  pass  percentage
sana                   98       98       56    252  Pass   84.000000
midha                  90       99       78    267  Pass   89.000000
summaiya               56      100       98    254  Pass   84.666667

In [127]:
df.iloc[0]

ai for everyone         78
python1                 78
python2                 23
total                  179
pass                 Fails
percentage         59.6667
Name: Nasir, dtype: object

In [129]:
df.iloc[0:4] # last index given not include in iloc

          ai for everyone  python1  python2  total   pass  percentage
Nasir                  78       78       23    179  Fails   59.666667
sana                   98       98       56    252   Pass   84.000000
midha                  90       99       78    267   Pass   89.000000
summaiya               56      100       98    254   Pass   84.666667

In [131]:
df.iloc[::-1]

          ai for everyone  python1  python2  total   pass  percentage
rabaat                 67       98        6    171  Fails   57.000000
maryah                 55       80        5    140  Fails   46.666667
summaiya               56      100       98    254   Pass   84.666667
midha                  90       99       78    267   Pass   89.000000
sana                   98       98       56    252   Pass   84.000000
Nasir                  78       78       23    179  Fails   59.666667

In [132]:
df.loc['summaiya']['ai for everyone'] # when

56

In [134]:
df.loc['abc'] = 'a'
df

         ai for everyone python1 python2 total   pass percentage
Nasir                 78      78      23   179  Fails    59.6667
sana                  98      98      56   252   Pass         84
midha                 90      99      78   267   Pass         89
summaiya              56     100      98   254   Pass    84.6667
maryah                55      80       5   140  Fails    46.6667
rabaat                67      98       6   171  Fails         57
abc                    a       a       a     a      a          a

In [135]:
df.loc['sara'] = [1,2,3,4,5,6]
df

         ai for everyone python1 python2 total   pass percentage
Nasir                 78      78      23   179  Fails    59.6667
sana                  98      98      56   252   Pass         84
midha                 90      99      78   267   Pass         89
summaiya              56     100      98   254   Pass    84.6667
maryah                55      80       5   140  Fails    46.6667
rabaat                67      98       6   171  Fails         57
abc                    a       a       a     a      a          a
sara                   1       2       3     4      5          6

In [112]:
a = list(range(5))
b = list(range(1,6))

print(a)
print(b)
c = zip(a,b)
for i in c:
    print(i)

[0, 1, 2, 3, 4]
[1, 2, 3, 4, 5]
(0, 1)
(1, 2)
(2, 3)
(3, 4)
(4, 5)

In [117]:
a = list(range(5))
b = list(range(1,6))
for x,y in zip(a,b):
    print(x,y)

0 1
1 2
2 3
3 4
4 5

In [118]:
a = list(range(5))
b = list(range(1,6))
for x,y in a,b:
    print(x,y)

ValueError: too many values to unpack (expected 2)